# Everything. A superset of Brewfile. Installed only on mac

brew 'ack'
brew 'aspell'
brew 'astyle'
brew 'autoconf'
brew 'automake'
brew 'bash-completion'
brew 'bash'
brew 'bat'
brew 'ccat'
brew 'cloc'
brew 'coreutils'
brew 'cowsay'
brew 'ctags'
brew 'dbus'
brew 'dockutil'
brew 'duti'
brew 'exiftool'
brew 'ffmpeg', args: ['with-fontconfig', 'with-libass']
brew 'flac'
brew 'fontconfig'
brew 'fzf'
brew 'gifify', link: false
brew 'giflossy'
brew 'gifsicle', link: false
brew 'git'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'go'
brew 'gpg'
brew 'graphicsmagick'
brew 'highlight'
brew 'htop'
brew 'httpie'
brew 'imagemagick'
brew 'jpegoptim'
brew 'jq'
brew 'lame'
brew 'leiningen'
brew 'libpng'
brew 'libsamplerate'
brew 'libsndfile'
brew 'libtiff'
brew 'libvorbis'
brew 'netcat'
brew 'ngrep'
brew 'optipng'
brew 'parallel'
brew 'pdsh'
brew 'pinentry-mac'
brew 'pkg-config'
brew 'pngcrush'
brew 'postgresql'
brew 'pwgen'
brew 'readline'
brew 'ripgrep'
brew 'rlwrap'
brew 'ruby', link: true
brew 'sbt'
brew 'scala'
brew 'sox'
brew 'tesseract'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vegeta'
brew 'vim'
brew 'waon'
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask'

cask '1password'
cask 'calibre'
cask 'flux'
cask 'flycut'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'keka'
cask 'keybase'
cask 'macdown'
cast 'monitorcontrol'
cask 'openemu'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookase'
cask 'sequel-pro'
cask 'slack'
cask 'slate'
cask 'spotify'
cask 'suspicious-package'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'webpquicklook'
cask 'xld'
cask 'xquartz'
