# Just the CLI necesseties. Installed everywhere: linux and mac, codespaces, etc

tap 'homebrew/bundle'
tap 'gbataille/homebrew-gba'

brew 'ack'
brew 'bat'
brew 'ccat'
brew 'diff-so-fancy'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'githud'
brew 'gpg'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'parallel'
brew 'pdsh'
brew 'prettier'
brew 'ripgrep'
brew 'ruby'
brew 'tmux'
brew 'tree'
brew 'vegeta'
brew 'vim'
brew 'yarn'
